# WoodEarlyColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodEarlyColor Property
AdvancedWood Class See Also
---
The property labeled "Earlywood color" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodEarlyColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodEarlyColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodEarlyColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace